tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
#include "FarmFeederApp.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <Esp32EncodedDcMotor.h>
#include <FarmAutoEventLog.h>

#include <esp_system.h>
#include <Wire.h>

#include <cstdlib>
#include <cstring>

#include "FeederBucket.h"
#include "FeederBucketRestore.h"
#include "FeederConfirm.h"
#include "FeederController.h"
#include "FeederDate.h"
#include "FeederFeedSettlement.h"
#include "FeederPersistenceStore.h"
#include "FeederRecordFileStore.h"
#include "FeederRecordLog.h"
#include "FeederRunTracker.h"
#include "FeederSchedule.h"
#include "FeederStorageLayout.h"
#include "FeederTarget.h"
#include "FeederToday.h"

namespace {

FeederController g_feeder;
FeederControllerConfig g_feederConfig;
FeederScheduleService g_schedules;
FeederBucketService g_buckets;
FeederTargetService g_targets;
FeederTodayService g_today;
FeederRunTracker g_runs;
FeederRecordLog g_records;
FeederConfirmGuard g_confirm;
uint32_t g_nextCommandId = 1;
uint16_t g_lastScheduleMinute = 24 * 60;
uint32_t g_lastScheduleDate = 0;
bool g_recordStorageReady = false;
Esp32At24cRecordStore::ArduinoWireI2cBus g_at24cBus;
Esp32At24cRecordStore::At24cI2cDevice g_at24cDevice(g_at24cBus, {});
Esp32At24cRecordStore::RecordStore g_at24cStore;
bool g_at24cStoreReady = false;

static constexpr uint8_t kFarmFeederRouteCount = 29;
static constexpr uint8_t kFeederI2cSda = 21;
static constexpr uint8_t kFeederI2cScl = 22;
static constexpr uint8_t kFeederPwmPins[kFeederConfiguredChannels] = {16, 17, 18};
static constexpr uint8_t kFeederEncoderPinsA[kFeederConfiguredChannels] = {33, 26, 14};
static constexpr uint8_t kFeederEncoderPinsB[kFeederConfiguredChannels] = {32, 25, 27};
static constexpr const char* kFeederRecordRootDir = "/records";
static constexpr const char* kFeederRecordDir = "/records/feeder";
static constexpr const char* kFeederRecordCurrentPath = "/records/feeder/current.far";
static constexpr uint32_t kFeederRecordMaxCurrentBytes = 64UL * 1024UL;
static constexpr uint8_t kFeederRecordMaxArchives = 16;
static_assert(ESP32BASE_WEB_MAX_ROUTES >= kFarmFeederRouteCount,
              "Esp32FarmFeeder requires ESP32BASE_WEB_MAX_ROUTES >= 29");

Esp32EncodedDcMotor::MotorHardwareConfig g_feederMotorHardware[kFeederConfiguredChannels];
Esp32EncodedDcMotor::EncoderBackendConfig g_feederEncoderBackend[kFeederConfiguredChannels];
Esp32EncodedDcMotor::MotorKinematics g_feederMotorKinematics[kFeederConfiguredChannels];
Esp32EncodedDcMotor::MotorMotionProfile g_feederMotorProfile[kFeederConfiguredChannels];
Esp32EncodedDcMotor::MotorProtection g_feederMotorProtection[kFeederConfiguredChannels];
Esp32EncodedDcMotor::MotorStopPolicy g_feederMotorStopPolicy[kFeederConfiguredChannels];
Esp32EncodedDcMotor::SinglePwmMotorDriver g_feederMotorDriver[kFeederConfiguredChannels];
Esp32EncodedDcMotor::PcntEncoderReader g_feederMotorEncoder[kFeederConfiguredChannels];
Esp32EncodedDcMotor::EncodedDcMotor g_feederMotor[kFeederConfiguredChannels];
bool g_feederMotorOutputEnabled = false;
uint8_t g_feederMotorReadyMask = 0;

uint8_t configuredChannelMask() {
  return static_cast<uint8_t>((1U << kFeederConfiguredChannels) - 1U);
}

bool validAppChannel(uint8_t channel) {
  return channel < kFeederConfiguredChannels;
}

bool schedulePlanExists(uint8_t planId) {
  const FeederScheduleSnapshot snapshot = g_schedules.snapshot();
  for (uint8_t i = 0; i < snapshot.planCount; ++i) {
    if (snapshot.plans[i].config.planId == planId) {
      return true;
    }
  }
  return false;
}

void addFarmFeederApi(const char* path, Esp32BaseWeb::Handler handler) {
  if (!Esp32BaseWeb::addApi(path, handler)) {
    ESP32BASE_LOG_E("farmfeeder", "api_route_register_failed path=%s", path);
  }
}

void beginRawJson(int code) {
  Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
}

void endRawJson() {
  Esp32BaseWeb::endResponse();
}

bool requireApiAuth() {
  if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
    return Esp32BaseWeb::checkPostAllowed("farmfeeder");
  }
  return Esp32BaseWeb::checkAuth();
}

bool i2cDeviceOnline(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

uint32_t allocateCommandId() {
  const uint32_t commandId = g_nextCommandId;
  ++g_nextCommandId;
  if (g_nextCommandId == 0) {
    g_nextCommandId = 1;
  }
  return commandId;
}

void syncFeederConfigFromBaseInfo() {
  g_feederConfig.enabledChannelMask = static_cast<uint8_t>(
      g_buckets.enabledChannelMask() & g_feederConfig.installedChannelMask & configuredChannelMask());
  const FeederCommandResult result = g_feeder.configure(g_feederConfig);
  g_runs.stopAll();
  if (result != FeederCommandResult::Ok) {
    ESP32BASE_LOG_E("farmfeeder", "feeder_config_sync_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

bool at24cWriteOk(Esp32At24cRecordStore::Result result) {
  return result == Esp32At24cRecordStore::Result::Ok ||
         result == Esp32At24cRecordStore::Result::Unchanged;
}

void persistFeederScheduleIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederSchedule(g_at24cStore, g_schedules.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "schedule_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederTodayIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result = saveFeederToday(g_at24cStore, g_today.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "today_save_failed result=%u", static_cast<unsigned>(result));
  }
}

void persistFeederTargetsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederTargets(g_at24cStore, g_targets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "targets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederBucketsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederBuckets(g_at24cStore, g_buckets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "buckets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

