tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void sendResolvedTargetArray(const FeederTargetBatch& batch) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederResolvedTarget& target = batch.channels[i];
    char number[16];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"result\":\"");
    Esp32BaseWeb::sendChunk(targetResultName(target.result));
    Esp32BaseWeb::sendChunk("\",\"targetPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendRecordJson(const FeederRecord& record) {
  char number[16];
  Esp32BaseWeb::sendChunk("{\"sequence\":");
  sendUint32(record.sequence);
  Esp32BaseWeb::sendChunk(",\"unixTime\":");
  sendUint32(record.unixTime);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(record.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(record.bootId);
  Esp32BaseWeb::sendChunk(",\"commandId\":");
  sendUint32(record.commandId);
  Esp32BaseWeb::sendChunk(",\"eventType\":\"");
  Esp32BaseWeb::sendChunk(recordTypeName(record.type));
  Esp32BaseWeb::sendChunk("\",\"result\":\"");
  Esp32BaseWeb::sendChunk(recordResultName(record.result));
  Esp32BaseWeb::sendChunk("\",\"planId\":");
  sendUint8(record.planId);
  Esp32BaseWeb::sendChunk(",\"channel\":");
  sendUint8(record.channel);
  Esp32BaseWeb::sendChunk(",\"requestedMask\":");
  sendUint8(record.requestedMask);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(record.successMask);
  Esp32BaseWeb::sendChunk(",\"busyMask\":");
  sendUint8(record.busyMask);
  Esp32BaseWeb::sendChunk(",\"faultMask\":");
  sendUint8(record.faultMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(record.skippedMask);
  Esp32BaseWeb::sendChunk(",\"targetPulses\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.targetPulses));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.estimatedGramsX100));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"actualPulses\":");
  snprintf(number, sizeof(number), "%ld", static_cast<long>(record.actualPulses));
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk("}");
}

void sendRecordArray(const FeederRecordSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendRecordArray(const FeederRecordPage& page) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < page.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(page.records[i]);
  }
  Esp32BaseWeb::sendChunk("]");
}

const char* appEventLevelName(FarmAutoEventLog::Level level) {
  switch (level) {
    case FarmAutoEventLog::LEVEL_INFO: return "info";
    case FarmAutoEventLog::LEVEL_WARN: return "warn";
    case FarmAutoEventLog::LEVEL_ERROR: return "error";
  }
  return "info";
}

void sendBusinessEventJson(const FarmAutoEventLog::BusinessEvent& event) {
  Esp32BaseWeb::sendChunk("{\"id\":");
  sendUint32(event.id);
  Esp32BaseWeb::sendChunk(",\"epochSec\":");
  sendUint32(event.epochSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(event.bootId);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(event.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"timeSynced\":");
  Esp32BaseWeb::sendChunk(event.timeSynced ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"level\":\"");
  Esp32BaseWeb::sendChunk(appEventLevelName(event.level));
  Esp32BaseWeb::sendChunk("\",\"domain\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.domain);
  Esp32BaseWeb::sendChunk("\",\"action\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.action);
  Esp32BaseWeb::sendChunk("\",\"target\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.target);
  Esp32BaseWeb::sendChunk("\",\"message\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.message);
  Esp32BaseWeb::sendChunk("\",\"detail\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.detail);
  Esp32BaseWeb::sendChunk("\",\"code\":");
  sendUint32(event.code);
  Esp32BaseWeb::sendChunk(",\"valueMask\":");
  sendUint32(event.valueMask);
  Esp32BaseWeb::sendChunk(",\"value1\":");
  sendInt32(event.value1);
  Esp32BaseWeb::sendChunk(",\"value2\":");
  sendInt32(event.value2);
  Esp32BaseWeb::sendChunk(",\"value3\":");
  sendInt32(event.value3);
  Esp32BaseWeb::sendChunk("}");
}

struct BusinessEventJsonState {
  uint16_t emitted = 0;
};

void sendBusinessEventJsonCallback(const FarmAutoEventLog::BusinessEvent& event, void* user) {
  BusinessEventJsonState* state = static_cast<BusinessEventJsonState*>(user);
  if (state == nullptr) {
    return;
  }
  if (state->emitted > 0) {
    Esp32BaseWeb::sendChunk(",");
  }
  sendBusinessEventJson(event);
  ++state->emitted;
}

void sendRecentCommandJson() {
  const FeederRecordSnapshot records = g_records.snapshot();
  for (uint8_t i = records.count; i > 0; --i) {
    const FeederRecord& record = records.records[i - 1];
    if (record.commandId == 0) {
      continue;
    }
    Esp32BaseWeb::sendChunk("{\"commandId\":");
    sendUint32(record.commandId);
    Esp32BaseWeb::sendChunk(",\"sequence\":");
    sendUint32(record.sequence);
    Esp32BaseWeb::sendChunk(",\"unixTime\":");
    sendUint32(record.unixTime);
    Esp32BaseWeb::sendChunk(",\"eventType\":\"");
    Esp32BaseWeb::sendChunk(recordTypeName(record.type));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::sendChunk(recordResultName(record.result));
    Esp32BaseWeb::sendChunk("\",\"planId\":");
    sendUint8(record.planId);
    Esp32BaseWeb::sendChunk(",\"channel\":");
    sendUint8(record.channel);
    Esp32BaseWeb::sendChunk(",\"requestedMask\":");
    sendUint8(record.requestedMask);
    Esp32BaseWeb::sendChunk(",\"successMask\":");
    sendUint8(record.successMask);
    Esp32BaseWeb::sendChunk(",\"skippedMask\":");
    sendUint8(record.skippedMask);
    Esp32BaseWeb::sendChunk("}");
    return;
  }
  Esp32BaseWeb::sendChunk("null");
}

bool readUint8Param(const char* name, uint8_t& out) {
  char raw[12];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0' || value > 255) {
    return false;
  }
  out = static_cast<uint8_t>(value);
  return true;
}

