tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
bool startFeederMotor(uint8_t channelIndex, int32_t targetPulses) {
  if (targetPulses <= 0) {
    return false;
  }
  const int32_t maxRunPulses = targetPulses + (targetPulses / 2) + 100;
  if (!configureFeederMotorIfEnabled(channelIndex, maxRunPulses)) {
    return false;
  }
  g_feederMotorEncoder[channelIndex].resetPosition(0);
  g_feederMotor[channelIndex].setCurrentPositionPulses(0);
  return g_feederMotor[channelIndex].requestMovePulses(targetPulses) ==
         Esp32EncodedDcMotor::MotorResult::Ok;
}

void requestFeederMotorStop(uint8_t channelMask) {
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) != 0 && feederMotorReady(i)) {
      g_feederMotor[i].requestStop();
      g_runs.updateActualPulses(i, static_cast<int32_t>(g_feederMotor[i].snapshot().positionPulses));
    }
  }
}

void sendFeederMotorOutputJson() {
  Esp32BaseWeb::sendChunk("\"motorOutput\":{\"enabled\":");
  Esp32BaseWeb::sendChunk(g_feederMotorOutputEnabled ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"readyMask\":");
  sendUint8(g_feederMotorReadyMask);
  Esp32BaseWeb::sendChunk(",\"channels\":[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    Esp32BaseWeb::sendChunk("{\"index\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"ready\":");
    Esp32BaseWeb::sendChunk(feederMotorReady(i) ? "true" : "false");
    if (feederMotorReady(i)) {
      const Esp32EncodedDcMotor::MotorSnapshot motor = g_feederMotor[i].snapshot();
      Esp32BaseWeb::sendChunk(",\"positionPulses\":");
      sendInt32(static_cast<int32_t>(motor.positionPulses));
      Esp32BaseWeb::sendChunk(",\"targetPulses\":");
      sendInt32(static_cast<int32_t>(motor.targetPulses));
      Esp32BaseWeb::sendChunk(",\"outputPercent\":");
      sendUint8(motor.driverOutputPercent);
      Esp32BaseWeb::sendChunk(",\"faultReason\":");
      sendUint8(static_cast<uint8_t>(motor.faultReason));
    }
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void settleStoppedRuns(uint8_t channelMask) {
  bool changed = false;
  const FeederRunSnapshot runs = g_runs.snapshot();
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0 || !runs.channels[i].active) {
      continue;
    }
    FeederRunChannel completed;
    if (!g_runs.finish(i, runs.channels[i].actualPulses, completed)) {
      continue;
    }
    FeederFeedSettlement settlement;
    const FeederFeedSettlementResult result =
        settleCompletedFeederRun(i, completed, g_today, g_buckets, settlement);
    if (result == FeederFeedSettlementResult::Ok ||
        result == FeederFeedSettlementResult::Underflow) {
      changed = true;
    }
  }
  if (changed) {
    persistFeederTodayIfReady();
    persistFeederBucketsIfReady();
  }
}

void updateFeederMotors() {
  if (g_feederMotorReadyMask == 0) {
    return;
  }
  uint8_t completedMask = 0;
  uint8_t faultMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((g_feeder.snapshot().runningChannelMask & bit) == 0 || !feederMotorReady(i)) {
      continue;
    }
    g_feederMotor[i].update(millis());
    const Esp32EncodedDcMotor::MotorSnapshot motor = g_feederMotor[i].snapshot();
    g_runs.updateActualPulses(i, static_cast<int32_t>(motor.positionPulses));
    if (motor.state == Esp32EncodedDcMotor::MotorState::Idle) {
      if (g_feeder.completeChannel(i) == FeederCommandResult::Ok) {
        completedMask |= bit;
      }
    } else if (motor.state == Esp32EncodedDcMotor::MotorState::Fault) {
      g_feeder.setChannelFault(i);
      faultMask |= bit;
    }
  }
  if (completedMask != 0) {
    settleStoppedRuns(completedMask);
  }
  if (faultMask != 0) {
    FarmAutoEventLog::recordStorageWarning("feeder_motor", "motor_fault", faultMask);
  }
}

const char* scheduleResultName(FeederScheduleResult result) {
  switch (result) {
    case FeederScheduleResult::Ok: return "Ok";
    case FeederScheduleResult::Full: return "Full";
    case FeederScheduleResult::NotFound: return "NotFound";
    case FeederScheduleResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

const char* feederCommandResultName(FeederCommandResult result) {
  switch (result) {
    case FeederCommandResult::Ok: return "Ok";
    case FeederCommandResult::Partial: return "Partial";
    case FeederCommandResult::Busy: return "Busy";
    case FeederCommandResult::NotConfigured: return "NotConfigured";
    case FeederCommandResult::Fault: return "Fault";
    case FeederCommandResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

void sendStartResultJson(const FeederStartResult& result,
                         const FeederTargetBatch* targets = nullptr,
                         uint32_t commandId = 0) {
  const bool success = result.result == FeederCommandResult::Ok ||
                       result.result == FeederCommandResult::Partial;
  beginRawJson(success ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(feederCommandResultName(result.result));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(result.successMask);
  Esp32BaseWeb::sendChunk(",\"busyMask\":");
  sendUint8(result.busyMask);
  Esp32BaseWeb::sendChunk(",\"faultMask\":");
  sendUint8(result.faultMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(result.skippedMask);
  if (targets) {
    Esp32BaseWeb::sendChunk(",\"targetOkMask\":");
    sendUint8(targets->okMask);
    Esp32BaseWeb::sendChunk(",\"targetInvalidMask\":");
    sendUint8(targets->invalidMask);
    Esp32BaseWeb::sendChunk(",\"targetNotCalibratedMask\":");
    sendUint8(targets->notCalibratedMask);
    Esp32BaseWeb::sendChunk(",\"targets\":");
    sendResolvedTargetArray(*targets);
  }
  Esp32BaseWeb::sendChunk(",");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
}

