tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  if (serviceDate != g_lastScheduleDate) {
    g_schedules.beginDay(serviceDate);
    g_today.beginDay(serviceDate);
    g_lastScheduleDate = serviceDate;
    g_lastScheduleMinute = 24 * 60;
    persistFeederScheduleIfReady();
    persistFeederTodayIfReady();
  }
  if (currentMinute == g_lastScheduleMinute) {
    return;
  }
  g_lastScheduleMinute = currentMinute;

  const FeederScheduleTick tick = g_schedules.evaluate(currentMinute, true);
  if (tick.action == FeederScheduleAction::NoAction) {
    return;
  }
  if (tick.action == FeederScheduleAction::MarkMissed) {
    FeederRecord record;
    record.type = FeederRecordType::ScheduleMissed;
    record.result = FeederRecordResult::Skipped;
    record.planId = tick.planId;
    recordBusinessEvent(record);
    ESP32BASE_LOG_W("farmfeeder", "schedule_missed plan_id=%u date=%lu minute=%u",
                    static_cast<unsigned>(tick.planId),
                    static_cast<unsigned long>(serviceDate),
                    static_cast<unsigned>(currentMinute));
    persistFeederScheduleIfReady();
    return;
  }

  FeederPlanConfig plan;
  if (!findPlanConfig(tick.planId, plan)) {
    ESP32BASE_LOG_W("farmfeeder", "schedule_plan_missing plan_id=%u",
                    static_cast<unsigned>(tick.planId));
    return;
  }

  g_schedules.markAttempted(tick.planId);
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result = startPlanTargets(plan, targets);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ScheduleTriggered;
  record.result = feederRecordResultFromCommand(result.result);
  record.planId = tick.planId;
  record.requestedMask = plan.channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  persistFeederScheduleIfReady();
  ESP32BASE_LOG_I("farmfeeder",
                  "schedule_triggered plan_id=%u result=%u success_mask=%u skipped_mask=%u",
                  static_cast<unsigned>(tick.planId),
                  static_cast<unsigned>(result.result),
                  static_cast<unsigned>(result.successMask),
                  static_cast<unsigned>(result.skippedMask));
#endif
}

void FarmFeederApp::configureStaticDefaults() {
  g_feederConfig.installedChannelMask = configuredChannelMask();
  g_feederConfig.enabledChannelMask = configuredChannelMask();

  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    g_feederMotorHardware[i].driverType = Esp32EncodedDcMotor::DriverType::SinglePwm;
    g_feederMotorHardware[i].pwmFrequencyHz = 20000;
    g_feederMotorHardware[i].pwmResolutionBits = 8;
    g_feederMotorHardware[i].ledcChannelA = i;

    g_feederEncoderBackend[i].backendType = Esp32EncodedDcMotor::EncoderBackendType::Pcnt;
    g_feederEncoderBackend[i].pinA = kFeederEncoderPinsA[i];
    g_feederEncoderBackend[i].pinB = kFeederEncoderPinsB[i];
    g_feederEncoderBackend[i].countMode = Esp32EncodedDcMotor::CountMode::X1;
    g_feederEncoderBackend[i].pcntUnit = i;
    g_feederEncoderBackend[i].glitchFilterNs = 1000;

    g_feederMotorKinematics[i].motorShaftPulsesPerRev = 16;
    g_feederMotorKinematics[i].outputPulsesPerRev = 4320;
    g_feederMotorKinematics[i].countMode = Esp32EncodedDcMotor::CountMode::X1;

    g_feederMotorProfile[i].speedPercent = 60;
    g_feederMotorProfile[i].softStartMs = 500;
    g_feederMotorProfile[i].softStopMs = 300;
    g_feederMotorProfile[i].minEffectiveSpeedPercent = 15;

    g_feederMotorProtection[i].startupGraceMs = 1000;
    g_feederMotorProtection[i].stallCheckIntervalMs = 250;
    g_feederMotorProtection[i].minPulseDelta = 1;
    g_feederMotorProtection[i].maxRunMs = 30000;
    g_feederMotorStopPolicy[i].emergencyOutputMode =
        Esp32EncodedDcMotor::EmergencyOutputMode::Coast;
  }

  g_schedules.beginDay(0);
  g_today.beginDay(0);

  FeederChannelBaseInfo channelInfo;
  channelInfo.enabled = true;
  channelInfo.outputPulsesPerRev = 4320;
  channelInfo.gramsPerRevX100 = 7000;
  channelInfo.capacityGramsX100 = 500000;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    snprintf(channelInfo.name, sizeof(channelInfo.name), "通道 %u", static_cast<unsigned>(i + 1));
    if (g_buckets.updateBaseInfo(i, channelInfo) != FeederBucketResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "bucket_base_info_failed channel=%u", static_cast<unsigned>(i));
    }
    FeederTargetRequest target;
    target.mode = FeederTargetMode::Grams;
    target.targetGramsX100 = 7000;
    if (g_targets.setTarget(i, target) != FeederTargetResult::Ok) {
      ESP32BASE_LOG_E("farmfeeder", "target_default_failed channel=%u", static_cast<unsigned>(i));
    }
  }
  syncFeederConfigFromBaseInfo();
}

void FarmFeederApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmFeeder 参数");
  Esp32BaseAppConfig::addGroup({"motor", "电机"});
  Esp32BaseAppConfig::addBool({"motor", "feeder", "motorOutput", "启用电机输出", false,
                               "启用后三路喂食命令会输出 PWM。", true, nullptr});
#endif
}

void FarmFeederApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("Esp32FarmFeeder");
  Esp32BaseWeb::setHomePath("/index");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_BOTTOM);
  Esp32BaseWeb::addNavItem("/index", "首页");
  Esp32BaseWeb::addNavItem("/schedule", "计划");
  Esp32BaseWeb::addNavItem("/records", "记录");
  Esp32BaseWeb::addNavItem("/base-info", "基础信息");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/index", "喂食器首页", FarmFeederApp::sendHomePage);
  Esp32BaseWeb::addPage("/schedule", "喂食计划", FarmFeederApp::sendSchedulePage);
  Esp32BaseWeb::addPage("/records", "喂食记录", FarmFeederApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/base-info", "基础信息", FarmFeederApp::sendBaseInfoPage);
  Esp32BaseWeb::addPage("/diagnostics", "喂食器诊断", FarmFeederApp::sendDiagnosticsPage);
  if (!Esp32BaseWeb::addRoute("/schedule/edit", Esp32BaseWeb::METHOD_GET, FarmFeederApp::sendScheduleEditPage)) {
    ESP32BASE_LOG_E("farmfeeder", "page_route_register_failed path=/schedule/edit");
  }
  if (!Esp32BaseWeb::addRoute("/base-info/edit", Esp32BaseWeb::METHOD_GET, FarmFeederApp::sendBaseInfoEditPage)) {
    ESP32BASE_LOG_E("farmfeeder", "page_route_register_failed path=/base-info/edit");
  }
  addFarmFeederApi("/api/app/status", FarmFeederApp::sendStatusJson);
  addFarmFeederApi("/api/app/diagnostics", FarmFeederApp::sendDiagnosticsJson);
  addFarmFeederApi("/api/app/events/recent", FarmFeederApp::sendRecentEventsJson);
  addFarmFeederApi("/api/app/feeders/manual-start", FarmFeederApp::handleFeederManualStart);
  addFarmFeederApi("/api/app/feeders/start", FarmFeederApp::handleFeederStart);
  addFarmFeederApi("/api/app/feeders/stop", FarmFeederApp::handleFeederStop);
  addFarmFeederApi("/api/app/feeders/stop-all", FarmFeederApp::handleFeederStopAll);
  addFarmFeederApi("/api/app/feeders/targets", FarmFeederApp::sendTargetsJson);
  addFarmFeederApi("/api/app/feeders/target", FarmFeederApp::handleFeederTarget);
  addFarmFeederApi("/api/app/schedules", FarmFeederApp::sendSchedulesJson);
  addFarmFeederApi("/api/app/schedules/create", FarmFeederApp::handleScheduleCreate);
  addFarmFeederApi("/api/app/schedules/update", FarmFeederApp::handleScheduleUpdate);
  addFarmFeederApi("/api/app/schedules/delete", FarmFeederApp::handleScheduleDelete);
  addFarmFeederApi("/api/app/schedule-occurrence/skip", FarmFeederApp::handleScheduleSkip);
  addFarmFeederApi("/api/app/schedule-occurrence/cancel-skip", FarmFeederApp::handleScheduleCancelSkip);
  addFarmFeederApi("/api/app/buckets", FarmFeederApp::sendBucketsJson);
  addFarmFeederApi("/api/app/buckets/set-remaining", FarmFeederApp::handleBucketSetRemaining);
  addFarmFeederApi("/api/app/buckets/add-feed", FarmFeederApp::handleBucketAddFeed);
  addFarmFeederApi("/api/app/buckets/mark-full", FarmFeederApp::handleBucketMarkFull);
  addFarmFeederApi("/api/app/base-info", FarmFeederApp::sendBaseInfoJson);
  addFarmFeederApi("/api/app/base-info/channel", FarmFeederApp::handleBaseInfoChannel);
  addFarmFeederApi("/api/app/records", FarmFeederApp::sendRecordsJson);
  addFarmFeederApi("/api/app/maintenance/clear-today", FarmFeederApp::handleMaintenanceClearToday);
  addFarmFeederApi("/api/app/maintenance/clear-fault", FarmFeederApp::handleMaintenanceClearFault);
#endif
}

