tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::sendDiagnosticsPage() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::sendHeader("喂食器诊断");
  Esp32BaseWeb::sendChunk("<h1>诊断</h1><section><h2>业务诊断</h2>");
  Esp32BaseWeb::sendChunk("<p><a href='/api/app/diagnostics'>查看诊断 JSON</a></p>");
  Esp32BaseWeb::sendChunk("<p><a href='/api/app/status'>查看状态 JSON</a></p>");
  Esp32BaseWeb::sendChunk("</section><section><h2>维护动作</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/clear-today'>");
  Esp32BaseWeb::sendChunk("<label>确认 token <input name='confirmToken'></label> ");
  Esp32BaseWeb::sendChunk("<label>确认 <input name='confirm' value='true'></label> ");
  Esp32BaseWeb::sendChunk("<button>清空今日执行状态</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/clear-fault'>");
  Esp32BaseWeb::sendChunk("<label>通道掩码 <input name='channelMask' value='7'></label> ");
  Esp32BaseWeb::sendChunk("<label>确认 token <input name='confirmToken'></label> ");
  Esp32BaseWeb::sendChunk("<label>确认 <input name='confirm' value='true'></label> ");
  Esp32BaseWeb::sendChunk("<button>清除通道故障</button></form>");
  Esp32BaseWeb::sendChunk("</section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendStatusJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederRunSnapshot runSnapshot = g_runs.snapshot();
  const FeederScheduleSnapshot scheduleSnapshot = g_schedules.snapshot();
  const FeederBucketSnapshot bucketSnapshot = g_buckets.snapshot();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmFeeder\",");
  Esp32BaseWeb::sendChunk("\"firmware\":\"");
  Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
  Esp32BaseWeb::sendChunk("\",\"schemaVersion\":1,");
  Esp32BaseWeb::sendChunk("\"state\":\"");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"installedChannelMask\":");
  sendUint8(snapshot.installedChannelMask);
  Esp32BaseWeb::sendChunk(",\"enabledChannelMask\":");
  sendUint8(snapshot.enabledChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningChannelMask\":");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk(",\"faultChannelMask\":");
  sendUint8(snapshot.faultChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningCount\":");
  sendUint8(snapshot.runningCount);
  Esp32BaseWeb::sendChunk(",\"channels\":");
  sendChannelArray(snapshot, runSnapshot);
  Esp32BaseWeb::sendChunk(",\"schedule\":");
  sendScheduleSummary(scheduleSnapshot);
  Esp32BaseWeb::sendChunk(",\"bucketSummary\":");
  sendBucketAggregate(bucketSnapshot);
  Esp32BaseWeb::sendChunk(",\"today\":");
  sendTodaySummary(g_today.snapshot());
  Esp32BaseWeb::sendChunk(",\"recentCommand\":");
  sendRecentCommandJson();
  Esp32BaseWeb::sendChunk(",");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendDiagnosticsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederScheduleSnapshot scheduleSnapshot = g_schedules.snapshot();
  const FeederBucketSnapshot bucketSnapshot = g_buckets.snapshot();
  const FeederRecordSnapshot recordSnapshot = g_records.snapshot();

  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmFeeder\",\"mode\":\"readOnlyDiagnostics\"");
  Esp32BaseWeb::sendChunk(",\"state\":\"");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"installedChannelMask\":");
  sendUint8(snapshot.installedChannelMask);
  Esp32BaseWeb::sendChunk(",\"enabledChannelMask\":");
  sendUint8(snapshot.enabledChannelMask);
  Esp32BaseWeb::sendChunk(",\"runningChannelMask\":");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk(",\"faultChannelMask\":");
  sendUint8(snapshot.faultChannelMask);
  Esp32BaseWeb::sendChunk(",\"schedule\":");
  sendScheduleSummary(scheduleSnapshot);
  Esp32BaseWeb::sendChunk(",\"bucketSummary\":");
  sendBucketAggregate(bucketSnapshot);
  Esp32BaseWeb::sendChunk(",\"records\":{\"recentCount\":");
  sendUint8(recordSnapshot.count);
  Esp32BaseWeb::sendChunk(",\"recentCapacity\":");
  sendUint8(kFeederRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"flashReady\":");
#if ESP32BASE_ENABLE_FS
  Esp32BaseWeb::sendChunk(Esp32BaseFs::isReady() ? "true" : "false");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk("},\"currentSensors\":{\"installed\":false},");
  Esp32BaseWeb::sendChunk("\"at24c\":{\"storeReady\":");
  Esp32BaseWeb::sendChunk(g_at24cStoreReady ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"online\":");
  Esp32BaseWeb::sendChunk(i2cDeviceOnline(0x50) ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"address\":\"0x50\"},");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::sendRecentEventsJson() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint32_t limitParam = 32;
  uint32_t offsetParam = 0;
  if (!readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("start", offsetParam) ||
      limitParam == 0 || limitParam > 100 || offsetParam > UINT16_MAX) {
    beginRawJson(400);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"InvalidArgument\"}");
    endRawJson();
    return;
  }
  BusinessEventJsonState state;
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"store\":\"app_events\",\"ready\":");
  Esp32BaseWeb::sendChunk(FarmAutoEventLog::isReady() ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"faulted\":");
  Esp32BaseWeb::sendChunk(FarmAutoEventLog::faulted() ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(FarmAutoEventLog::count());
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(FarmAutoEventLog::capacity());
  Esp32BaseWeb::sendChunk(",\"events\":[");
  const bool readOk = FarmAutoEventLog::readLatest(static_cast<uint16_t>(offsetParam),
                                                   static_cast<uint16_t>(limitParam),
                                                   sendBusinessEventJsonCallback,
                                                   &state);
  Esp32BaseWeb::sendChunk("],\"readOk\":");
  Esp32BaseWeb::sendChunk(readOk ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"returned\":");
  sendUint32(state.emitted);
  Esp32BaseWeb::sendChunk(",\"lastError\":\"");
  Esp32BaseWeb::writeJsonEscaped(FarmAutoEventLog::lastError());
  Esp32BaseWeb::sendChunk("\"}");
  endRawJson();
#endif
}

