tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::TodayCleared;
  record.result = FeederRecordResult::Ok;
  recordBusinessEvent(record);
  FarmAutoEventLog::recordFeederTodayCleared();

  sendResultJson(200, "Ok", commandId);
#endif
}

void FarmFeederApp::handleMaintenanceClearFault() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "channelMask:%u", static_cast<unsigned>(channelMask));
  if (!requireConfirm("clear-fault", resource)) {
    return;
  }

  const uint32_t commandId = allocateCommandId();
  uint8_t successMask = 0;
  uint8_t skippedMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0) {
      continue;
    }
    const FeederCommandResult result = g_feeder.clearChannelFault(i);
    if (result == FeederCommandResult::Ok) {
      successMask |= bit;
    } else {
      skippedMask |= bit;
    }
  }

  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::FaultCleared;
  record.result = successMask != 0 && skippedMask == 0
                    ? FeederRecordResult::Ok
                    : (successMask != 0 ? FeederRecordResult::Partial
                                        : FeederRecordResult::InvalidArgument);
  record.requestedMask = channelMask;
  record.successMask = successMask;
  record.skippedMask = skippedMask;
  recordBusinessEvent(record);
  if (successMask != 0) {
    FarmAutoEventLog::recordFeederFaultCleared(successMask);
  }

  beginRawJson(successMask != 0 ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(successMask != 0 && skippedMask == 0
                            ? "Ok"
                            : (successMask != 0 ? "Partial" : "InvalidArgument"));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"requestedMask\":");
  sendUint8(channelMask);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(successMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(skippedMask);
  Esp32BaseWeb::sendChunk(",");
  sendFeederMotorOutputJson();
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::handleScheduleCreate() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  FeederPlanConfig config;
  if (!readPlanConfigFromParams(config)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederScheduleMutation mutation = g_schedules.addPlan(config);
  if (mutation.result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  beginRawJson(mutation.result == FeederScheduleResult::Ok ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(scheduleResultName(mutation.result));
  Esp32BaseWeb::sendChunk("\",\"planId\":");
  sendUint8(mutation.planId);
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::handleScheduleUpdate() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  FeederPlanConfig config;
  if (!readUint8Param("planId", planId) || !readPlanConfigFromParams(config)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederScheduleResult result = g_schedules.updatePlan(planId, config);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 400, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleDelete() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  if (!readUint8Param("planId", planId)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u", static_cast<unsigned>(planId));
  if (!requireConfirm("delete-plan", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.deletePlan(planId);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleSkip() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  uint32_t serviceDate = g_schedules.snapshot().serviceDate;
  if (!readUint8Param("planId", planId) || !readUint32ParamOptional("date", serviceDate) ||
      serviceDate == 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u:%lu",
           static_cast<unsigned>(planId),
           static_cast<unsigned long>(serviceDate));
  if (!requireConfirm("skip-occurrence", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.skipOccurrence(planId, serviceDate);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
    FarmAutoEventLog::recordScheduleSkipped(planId, serviceDate);
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleCancelSkip() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  uint32_t serviceDate = g_schedules.snapshot().serviceDate;
  if (!readUint8Param("planId", planId) || !readUint32ParamOptional("date", serviceDate) ||
      serviceDate == 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u:%lu",
           static_cast<unsigned>(planId),
           static_cast<unsigned long>(serviceDate));
  if (!requireConfirm("cancel-skip", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.cancelSkipOccurrence(planId, serviceDate);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
    FarmAutoEventLog::recordScheduleSkipCanceled(planId, serviceDate);
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleBucketSetRemaining() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  int32_t remainGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readFixedX100ParamOptional("remainGrams", "remainGramsX100", remainGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("set-bucket", resource)) {
    return;
  }
  const int32_t oldRemain = g_buckets.snapshot().channels[channel].remainGramsX100;
  const FeederBucketResult result = g_buckets.setRemaining(channel, remainGramsX100, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
    FarmAutoEventLog::recordFeederBucketRemainingSet(channel, oldRemain, remainGramsX100);
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

